import React from "react"
import "./style.css"
import {
    Button
} from 'reactstrap';

const Blog = () => {
    return (
        <div className="container">
            <h1 className="headings">Blog</h1>
            <div className="blog">

                <h5> प्रस्तावित नागरिकता (संशोधन) विधेयक: भारतीय समाज और संस्कृति के ताने-बाने को बिखेरने पर आमदा सरकार</h5>
                <p>चार दिसम्बर को प्रधानमंत्री की अध्यक्षता में केन्द्रीय कैबिनेट ने प्रस्तावित नागरिकता संशोधन विधेयक,2019 को मंज़ूरी दी और शीतकालीन सत्र में इसे संसद में पेश करने का निर्णय लिया। सत्तारूढ़ दल के शीर्ष नेतृत्व की मानें, तो यह विधेयक उतना ही महत्वपूर्ण है जितना अनुच्छेद 370 के अधिकतर प्रावधानों को खत्म करने वाला विधेयक था। साथ ही, इसकी विपक्ष के द्वारा की जा रही आलोचना के प्रति आक्रामक होने की अपील भाजपा से की। ध्यातव्य है कि काँग्रेस और ऑल इंडिया यूनाइटेड डेमोक्रेटिक फ्रंट धार्मिक आधार पर नागरिकता देने को लेकर इसका विरोध कर रहे हैं। दरअसल इस संशोधन को असम समझौता, 1985 का उल्लंघन बताया जा रहा है। </p>
                <p>चार दिसम्बर को प्रधानमंत्री की अध्यक्षता में केन्द्रीय कैबिनेट ने प्रस्तावित नागरिकता संशोधन विधेयक,2019 को मंज़ूरी दी और शीतकालीन सत्र में इसे संसद में पेश करने का निर्णय लिया। सत्तारूढ़ दल के शीर्ष नेतृत्व की मानें, तो यह विधेयक उतना ही महत्वपूर्ण है जितना अनुच्छेद 370 के अधिकतर प्रावधानों को खत्म करने वाला विधेयक था। साथ ही, इसकी विपक्ष के द्वारा की जा रही आलोचना के प्रति आक्रामक होने की अपील भाजपा से की। ध्यातव्य है कि काँग्रेस और ऑल इंडिया यूनाइटेड डेमोक्रेटिक फ्रंट धार्मिक आधार पर नागरिकता देने को लेकर इसका विरोध कर रहे हैं। दरअसल इस संशोधन को असम समझौता, 1985 का उल्लंघन बताया जा रहा है। </p>
                <p>चार दिसम्बर को प्रधानमंत्री की अध्यक्षता में केन्द्रीय कैबिनेट ने प्रस्तावित नागरिकता संशोधन विधेयक,2019 को मंज़ूरी दी और शीतकालीन सत्र में इसे संसद में पेश करने का निर्णय लिया। सत्तारूढ़ दल के शीर्ष नेतृत्व की मानें, तो यह विधेयक उतना ही महत्वपूर्ण है जितना अनुच्छेद 370 के अधिकतर प्रावधानों को खत्म करने वाला विधेयक था। साथ ही, इसकी विपक्ष के द्वारा की जा रही आलोचना के प्रति आक्रामक होने की अपील भाजपा से की। ध्यातव्य है कि काँग्रेस और ऑल इंडिया यूनाइटेड डेमोक्रेटिक फ्रंट धार्मिक आधार पर नागरिकता देने को लेकर इसका विरोध कर रहे हैं। दरअसल इस संशोधन को असम समझौता, 1985 का उल्लंघन बताया जा रहा है। </p>
                <p>चार दिसम्बर को प्रधानमंत्री की अध्यक्षता में केन्द्रीय कैबिनेट ने प्रस्तावित नागरिकता संशोधन विधेयक,2019 को मंज़ूरी दी और शीतकालीन सत्र में इसे संसद में पेश करने का निर्णय लिया। सत्तारूढ़ दल के शीर्ष नेतृत्व की मानें, तो यह विधेयक उतना ही महत्वपूर्ण है जितना अनुच्छेद 370 के अधिकतर प्रावधानों को खत्म करने वाला विधेयक था। साथ ही, इसकी विपक्ष के द्वारा की जा रही आलोचना के प्रति आक्रामक होने की अपील भाजपा से की। ध्यातव्य है कि काँग्रेस और ऑल इंडिया यूनाइटेड डेमोक्रेटिक फ्रंट धार्मिक आधार पर नागरिकता देने को लेकर इसका विरोध कर रहे हैं। दरअसल इस संशोधन को असम समझौता, 1985 का उल्लंघन बताया जा रहा है। </p>
                <Button className="carousel-button">Read Blog</Button>
            </div>
        </div>
    )
}

export default Blog;